Revit 2024 API
Camera.EyePosition Property
 Camera's position in the world
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ EyePosition { get; set; }
Visual Basic
Public Property EyePosition As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ EyePosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace